{
    "profile": {
        "name": "Thomas Gabriel de Souza Barros",
        "role": "Unity Gameplay Engineer & C# Systems Developer",
        "headline": "Unity Development, Multiplayer Systems, Backend Architecture, and Interactive Experiences.",
        "about": [
            "I am a Unity Developer with solid experience across VR, WebGL, Mobile, and Desktop platforms.",
            "I thrive in fast-paced environments, quickly adapting to new challenges and technologies.",
            "Passionate about building efficient, scalable, and user-centered solutions, I combine strong technical skills with creative problem-solving.",
            "I’m driven by innovation and committed to delivering high-quality results on time, always seeking opportunities to grow and contribute to impactful projects."
        ],
        "avatarUrl": "https://i.imgur.com/cBxFcRH.jpeg",
        "social": {
            "github": "https://github.com/Thomasdfoz",
            "linkedin": "https://www.linkedin.com/in/thomasprogrammer/",
            "itchio": "https://thomasdfoz.itch.io/"
        }
    },
    "skills": {
        "Game Development & Simulation": [
            "Unity Core (Addressables, XR Interaction Toolkit, UI Toolkit, Terrain Tools, ScriptableObjects, Scene Management)",
            "Gameplay Systems (player controllers, HUD, feedback loops, exercise scripting, checkpoints)",
            "Graphics & Rendering (dynamic lighting, day/night cycles, post-processing, performance optimization)",
            "Audio Systems (animal soundscapes, environmental SFX, mixing and triggers)",
            "Transparent/Overlay Desktop Apps (Unity apps rendered over the desktop with windowless/transparent presentation)",
            "Cross-Platform Builds (VR, WebGL, Mobile, Desktop)"
        ],
        "Multiplayer & Connectivity": [
            "Photon (PUN2) – scalable multiplayer networking",
            "Mirror – modern high-level networking for Unity",
            "UNet (Legacy) – experience with deprecated Unity networking systems",
            "Unity Netcode for GameObjects (NGO) – official Unity multiplayer framework",
            "Unity Netcode for Entities – ECS-based multiplayer",
            "Unity Matchmaking & Relay Services – lobby, matchmaking, session management",
            "Colyseus – multiplayer framework for WebGL/VR",
            "WebSocket Integration – real-time communication, multi-device sync",
            "Agora.io – video calls, real-time AR streaming, chat, file sharing",
            "API Integration – Unity + external services, real-time content updates"
        ],
        "Architecture & Tools": [
            "UPM (Unity Package Manager) – modular architecture, multi-project reuse",
            "Editor Tools Development – custom workflows, automation, diagnostics",
            "Addressables + Dynamic Content – API-driven loading, scalable updates",
            "Pipelines – VR, WebGL, Mobile, Standalone",
            "Build Automation & Deployment"
        ],
        "Backend & Servers": [
            "C# Backend Development – APIs, server-side logic, database integration",
            "Python & Node.js Servers – real-time services and integrations",
            "Unity Headless Servers – non-rendered builds for Windows & Linux",
            "Database Management – design, queries, Unity integration",
            "Windows Service Applications – Unity projects running as background services",
            "API Gateways & Cloud – Azure, AWS, Oracle"
        ],
        "Additional Skills": [
            "QA & Debugging – stable builds, profiling, rapid iteration",
            "Documentation & Code Reviews – clean coding, modular practices",
            "Agile Teamwork – sprints, field testing, client delivery"
        ]
    },
    "projects": [
        {
            "id": "2",
            "title": "Battle of Herone",
            "year": 2025,
            "tags": [
                "Game",
                "Multiplayer",
                "Steam"
            ],
            "imageUrl": "https://i.imgur.com/vMBkXXM.png",
            "description": "Strategy game with card system and tactical battles, published on Steam. All gameplay, unit system, cards, progression, and battle logic were developed from scratch, with asynchronous multiplayer based on API and database.",
            "longDescription": "Battle of Herone is a strategy game focused on tactical battles using cards to summon units and control the field. The entire project was created entirely by me: gameplay, card system, battle logic, economy, UI, maps, procedural art, internal tools, and Steam integration.\n\nThe multiplayer model is **asynchronous**, without real-time networking. Instead of direct connections between players, the game uses API + database to register states, send actions, process battle results, and maintain player progress. This format eliminates the need for dedicated servers and ensures fast, secure, and stable matches.\n\nTechnically, the project includes:\n- Complete card system (cost, rarity, attributes, effects, archetypes).\n- Fully original combat mechanics, with unit AI, movement, range, and target prioritization.\n- Deck management, progression, economy, and rewards.\n- Asynchronous backend via API, match control, result storage, and data persistence.\n- Internal tools in Unity for creating and balancing units.\n- Complete publication on Steamworks.\n\nIn my professional assessment, this project demonstrates total mastery of the essential layers of a commercial game: design, implementation, asynchronous multiplayer flow, content production, platform integration, and general stability. The natural next steps would be balancing telemetry, seasonal events, and content expansion (new factions, cards, and modes).",
            "technologies": [
                "Unity",
                "C#",
                "API",
                "Supabase",
                "Database",
                "Steamworks"
            ],
            "galleryImages": [
                "https://i.imgur.com/OgrmThJ.gif",
                "https://i.imgur.com/aeG76qn.gif",
                "https://i.imgur.com/QbdlmUo.gif",
                "https://i.imgur.com/T1E08sM.gif"
            ],
            "projectUrl": "https://store.steampowered.com/app/4015690/Battle_of_Herone/"
        },
        {
            "id": "19",
            "title": "DreamSelfie - AI Avatar Generator",
            "year": 2025,
            "tags": [
                "WebApp",
                "React",
                "Tailwind",
                "AI Integration",
                "Mobile First"
            ],
            "imageUrl": "https://i.imgur.com/nOmvxf6.png",
            "description": "An interactive platform utilizing Generative AI to transform user selfies into stylized avatars (Cyberpunk, 3D, Retro), featuring a modern and immersive interface.",
            "longDescription": "DreamSelfie is an application developed to democratize access to AI-generated art through a simplified and visually striking UX. The project focuses on a 'Mobile-First' experience, guiding the user through an intuitive flow: photo upload, artistic style selection (such as '80s Retro', 'Action Figure', 'Clay Animation'), and image generation. The interface utilizes a neon color palette and dark mode to create a futuristic atmosphere. Behind the fluid interface built with React and Tailwind, the application integrates diffusion model APIs to process transformations in real-time, demonstrating competence in complex API integration and responsive interface design.",
            "technologies": [
                "React",
                "Tailwind CSS",
                "Generative AI API",
                "Vite",
                "Framer Motion"
            ],
            "galleryImages": [
                "https://i.imgur.com/t8KB1pk.png",
                "https://i.imgur.com/F6pORxF.png",
                "https://i.imgur.com/lR7f3QL.png",
                "https://i.imgur.com/jYlHdnN.png",
                "https://i.imgur.com/mYgKApf.png",
                "https://i.imgur.com/2xIYqx7.png"
            ]
        },
        {
            "id": "20",
            "title": "TRAY-TASKER — Desktop Task Manager",
            "year": 2026,
            "tags": [
                "Desktop",
                "Open Source",
                "Productivity",
                "Electron"
            ],
            "imageUrl": "https://i.imgur.com/OVSId4Z.png",
            "description": "A lightweight Windows application that manages routines and tasks directly from the system tray, focusing on reducing distractions and maintaining workflow.",
            "longDescription": "TRAY-TASKER was developed to solve the problem of attention fragmentation during work. Unlike web-based managers, it resides in the Windows System Tray, allowing instant access without opening a browser. The project implements a weekly routine system with defined time blocks, triggering automatic notifications at the start and end of each activity. Being 100% Open Source, the code was structured modularly to allow the community to study the integration between Electron and React, while facilitating contributions via GitHub.",
            "technologies": [
                "Electron",
                "React",
                "TypeScript",
                "Tailwind CSS",
                "Node.js",
                "Windows Tray API"
            ],
            "galleryImages": [
                "https://i.imgur.com/2EkfACk.png",
                "https://i.imgur.com/jEudBke.png",
                "https://i.imgur.com/mcCFpVS.png"
            ],
            "projectUrl": "https://github.com/Thomasdfoz/TRAY-TASKER"
            },
            {
                "id": "21",
                "title": "Global Feed — High-Relevance Social Network",
                "year": 2025,
                "tags": [
                    "Social Media",
                    "UI/UX Design",
                    "React",
                    "Gamification"
                ],
                "imageUrl": "https://i.imgur.com/FbhudtH.png",
                "description": "A social network concept focused on quality through scarcity, featuring a limited credit system for global broadcasts.",
                "longDescription": "Global Feed is a platform that challenges traditional social media dynamics by introducing a limited posting credit system. The goal is to reduce digital noise by encouraging high-quality content that has the potential to reach the entire user base. The design features a minimalist 'Off-White' aesthetic with Electric Blue (#0066FF) accents, merging the structural familiarity of Facebook with Instagram's visual polish. I developed the entire Design System, including the core Credit Module with real-time countdowns and a responsive, immersive content composer.",
                "technologies": [
                    "React",
                    "TypeScript",
                    "Tailwind CSS",
                    "Framer Motion",
                    "UI/UX Strategy",
                    "Custom Design System"
                ],
                "galleryImages": [
                    "https://i.imgur.com/FbhudtH.png"
                ],
                "projectUrl": "https://i.imgur.com/FbhudtH.png"
            },
        {
            "id": "3",
            "title": "Forklift Simulator – Unity Training Project",
            "year": 2026,
            "tags": [
                "Simulation",
                "Training",
                "Unity"
            ],
            "imageUrl": "https://i.imgur.com/nnXtXAr.jpeg",
            "description": "3D forklift simulator for operator training, featuring realistic physics, modular architecture, and interactive exercises.",
            "longDescription": "Led the development of a forklift simulator designed to train operators in a safe and controlled virtual environment. The project features realistic forklift physics, modular cargo handling workflows, and interactive training exercises. Key systems include player controller, HUD feedback, checkpoints, and exercise scripting. WebSocket services were integrated for real-time communication and remote command execution, while a weather simulation system and remote control workflows enhanced realism and adaptability. The architecture was built with Unity Addressables and ScriptableObjects to optimize performance and scalability, supported by a CI/CD pipeline for WebGL and standalone builds. Delivered as a polished MVP with documentation, automated builds, and multi-stage deployment (Staging → Master → Production).",
            "technologies": [
                "Unity (Addressables, UI Toolkit, ScriptableObjects)",
                "C#",
                "WebSocket Integration",
                "Modular Architecture (asmdef)",
                "CI/CD Pipeline for WebGL/Standalone",
                "Weather & Remote Systems",
                "Forklift Physics & Gameplay Systems"
            ],
            "galleryImages": [
                "https://i.imgur.com/gzNdzKD.jpeg"
            ],
            "projectUrl": ""
        },
        {
            "id": "5",
            "title": "Mists of Krakovia: The Great Collapse",
            "year": 2025,
            "tags": [
                "Jam",
                "MMORPG"
            ],
            "imageUrl": "https://i.imgur.com/bcpl1UP.jpeg",
            "description": "MMORPG created in 1 month as part of a game jam.",
            "longDescription": "During a game jam, we developed Mists of Krakovia: The Great Collapse, an MMORPG with open-world mechanics, combat, and progression. The speed of the project required efficient design, rapid prototyping, and extensible architecture, and allowed exploring mission systems, inventory, and networking on a reduced scale.",
            "technologies": [
                "Unity",
                "C#",
                "Multiplayer"
            ],
            "galleryImages": [
                "https://i.imgur.com/viLkJeZ.jpeg",
                "https://i.imgur.com/TR2dEuy.jpeg",
                "https://i.imgur.com/R29erY9.jpeg"
            ],
            "projectUrl": ""
        },
        {
            "id": "6",
            "title": "Launcher — Mists of Krakovia",
            "year": 2025,
            "tags": [
                "Launcher",
                "Updater",
                "Unity",
                "UI Toolkit"
            ],
            "imageUrl": "https://i.imgur.com/WXfNO2f.jpeg",
            "description": "Professional launcher developed in Unity with UI Toolkit, responsible for automatically downloading and updating the latest version of the MMORPG Mists of Krakovia.",
            "longDescription": "This launcher was created to manage the entire update flow of Mists of Krakovia. Built in Unity using UI Toolkit, it connects to files hosted on GitHub Pages to check for the latest client version, download updates, apply patches, and ensure the player always has the most up-to-date version. The system includes automatic version checking, download with progress bar, file validation, extraction, and safe replacement of game data, inspired by the experience of professional MMORPG launchers like Albion and WoW.",
            "features": [
                "Interface built with Unity UI Toolkit",
                "Automatic version checking using manifest.json hosted on GitHub Pages",
                "Game update download directly from GitHub Pages",
                "Visual progress system with download and verification status",
                "Integrity validation of downloaded files",
                "Automatic extraction and update of the game client",
                "Fallback for complete reinstallation if the current patch fails",
                "Design inspired by major MMORPG launchers"
            ],
            "technologies": [
                "Unity",
                "C#",
                "UI Toolkit",
                "GitHub Pages (Hosting versions and manifests)",
                "GitHub Releases (for builds)"
            ],
            "galleryImages": [
                ""
            ]
        },
        {
            "id": "18",
            "title": "Orbit - Project & Team Management",
            "year": 2026,
            "tags": [
                "WebApp",
                "React",
                "Tailwind",
                "SaaS"
            ],
            "imageUrl": "https://i.imgur.com/5tgCOxz.png",
            "description": "A comprehensive SaaS dashboard for project management and time tracking. Currently in development, it features interactive Kanban boards, client CRM, and detailed productivity analytics.",
            "longDescription": "Orbit is an ambitious project currently under development (targeted for 2026) designed to solve the fragmentation of productivity tools. The goal is to build a unified platform where agencies can manage tasks, track billable hours, and organize client data in one place. The application utilizes a modern stack with React and Tailwind CSS to deliver a responsive and visually striking 'Dark Mode' interface. Key features being implemented include a drag-and-drop Kanban board, real-time dashboard analytics for workload tracking, and an integrated timesheet system. This project showcases advanced frontend state management and complex UI component architecture.",
            "technologies": [
                "React",
                "Tailwind",
                "TypeScript",
                "Vite",
                "Recharts"
            ],
            "galleryImages": [
                "https://i.imgur.com/Bz4ujcK.png",
                "https://i.imgur.com/r7vM1JD.png",
                "https://i.imgur.com/fA1aSWl.png",
                "https://i.imgur.com/JgnxbaH.png",
                "https://i.imgur.com/WTzXsAt.png"
            ]
        },
        {
            "id": "7",
            "title": "POS - Point of Sale",
            "year": 2025,
            "tags": [
                "WebApp",
                "React",
                "Supabase"
            ],
            "imageUrl": "https://i.imgur.com/Kbw77E9.png",
            "description": "POS system developed to explore and validate modern frontend and backend practices using React, Supabase, and Tailwind. The project simulates a complete point of sale with authentication, product registration, and optimized operational flow.",
            "longDescription": "This project was created with the objective of reproducing a functional Point of Sale (POS), applying in practice modern technologies that I consider essential for building fast, robust, and scalable web applications. On the frontend, I used React with Vite to ensure excellent performance and a clear modular structure. With TailwindCSS, I developed a clean, responsive, and easy-to-evolve interface. On the backend, Supabase was chosen for the combination of PostgreSQL, authentication, and real-time APIs, which allowed quickly implementing the complete POS flow — including login, product management, and sales structure. This project serves as a solid proof of concept, demonstrating how to integrate these tools efficiently while maintaining a clean architecture, ready for future expansions like inventory control, administrative dashboards, and integrations with physical devices.",
            "technologies": [
                "React",
                "Supabase",
                "Tailwind",
                "TypeScript",
                "Vite"
            ],
            "galleryImages": [
                "https://i.imgur.com/4axDv1d.png",
                "https://i.imgur.com/ZJ8ufdQ.png",
                "https://i.imgur.com/3zL7Ude.png"
            ],
            "projectUrl": "https://thomasdfoz.github.io/pdv-moderno/"
        }
    ],
    "contact": {
        "title": "Let's Talk",
        "description": "If you are thinking about a game project, simulation, or AI, or just want to exchange an idea, I am at your disposal!",
        "email": "eletronicgamesstudio@gmail.com",
        "phone": "+55 45 99151-7779",
        "location": "Foz do Iguaçu, Brazil",
        "infoTitle": "Contact Information",
        "emailLabel": "Email",
        "phoneLabel": "Phone",
        "locationLabel": "Location",
        "form": {
            "nameLabel": "Name",
            "namePlaceholder": "Your name",
            "emailLabel": "Email",
            "emailPlaceholder": "your@email.com",
            "messageLabel": "Message",
            "messagePlaceholder": "Your message...",
            "whatsappButton": "WhatsApp",
            "emailButton": "Email",
            "whatsappMessage": "Hello, my name is {name}. My email is {email}. {message}",
            "emailSubject": "Contact from Portfolio by {name}",
            "emailBody": "Name: {name}\\r\\nEmail: {email}\\r\\n\\r\\nMessage:\\r\\n{message}"
        }
    },
    "navbar": {
        "about": "About",
        "work": "Work",
        "contact": "Contact"
    },
    "footer": {
        "rights": "All rights reserved."
    },
    "home": {
        "title": "My Work",
        "description": "Projects that translate my passion for technology and my dedication to building robust and engaging solutions."
    },
    "labels": {
        "skills": "Skills",
        "viewProjects": "View Projects",
        "projectNotFound": "Project not found",
        "backToWork": "Back to work",
        "back": "Back",
        "technologies": "Technologies Used",
        "viewProject": "View Project",
        "viewProjectDetails": "View project details",
        "projectImage": "Project image"
    }
}